ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/am243x/CBASS0_ISC.xml
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_1_start_address_l" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_1_start_address_l" offset="0x8430" width="32" description="The ISC Region 1 Start Address Low Register defines the start address bits 31 to 0 for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 1 ISC.">
		<bitfield id="START_ADDRESS_L" width="20" begin="31" end="12" resetval="0x0" description="Start address bits 31 to 12." range="31 - 12" rwaccess="R/W"/> 
		<bitfield id="START_ADDRESS_LSB" width="12" begin="11" end="0" resetval="0x0" description="Start address bits 11 to 0 must be 0 as address must be 4KB aligned in address mode. Can also be channel number in channel mode." range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_1_start_address_h" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_1_start_address_h" offset="0x8434" width="32" description="The ISC Region 1 Start Address High Register defines the start address bits 47 to 32 for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 1 ISC.">
		<bitfield id="START_ADDRESS_H" width="16" begin="15" end="0" resetval="0x0" description="Start address bits 47 to 32." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_1_end_address_l" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_1_end_address_l" offset="0x8438" width="32" description="The ISC Region 1 End Address Low Register defines the end included address bits 31 to 0 for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 1 ISC.">
		<bitfield id="END_ADDRESS_L" width="20" begin="31" end="12" resetval="0x0" description="End address bits 31 to 12 to include in the match." range="31 - 12" rwaccess="R/W"/> 
		<bitfield id="END_ADDRESS_LSB" width="12" begin="11" end="0" resetval="0x4095" description="End address bits 11 to 0 are forced to Fs as address must be 4KB aligned." range="11 - 0" rwaccess="R"/>
	</register>
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_1_end_address_h" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_1_end_address_h" offset="0x843C" width="32" description="The ISC Region 1 End Address High Register defines the end address bits 47 to 32 for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 1 ISC.">
		<bitfield id="END_ADDRESS_H" width="16" begin="15" end="0" resetval="0x0" description="End address bits 47 to 32." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_2_control" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_2_control" offset="0x8440" width="32" description="The ISC Region 2 Control Register defines the control fields for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 2 ISC.">
		<bitfield id="NOPRIV" width="2" begin="27" end="26" resetval="0x0" description="Clear output priv attribute. If each bit is set then the outgoing priv bit is cleared." range="27 - 26" rwaccess="R/W"/> 
		<bitfield id="PRIV" width="2" begin="25" end="24" resetval="0x0" description="Set outgoing priv attribute. If each bit is set then the outgoing priv bit is set." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PASS" width="1" begin="21" end="21" resetval="0x0" description="No privID replacement, pass through value." range="21" rwaccess="R/W"/> 
		<bitfield id="NONSEC" width="1" begin="20" end="20" resetval="0x0" description="Make outgoing non-secure." range="20" rwaccess="R/W"/> 
		<bitfield id="SEC" width="4" begin="19" end="16" resetval="0x0" description="Make outgoing secure. A value of 0xA enables, others disable." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PRIV_ID" width="8" begin="15" end="8" resetval="0x179" description="Priv ID." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="DEF" width="1" begin="6" end="6" resetval="0x0" description="Default region indication. The default region is used when all other regions do not match." range="6" rwaccess="R"/> 
		<bitfield id="CH_MODE" width="1" begin="5" end="5" resetval="0x0" description="Enable channel mode to match region to a chanid value. Otherwise use address mode to match region to an address range." range="5" rwaccess="R/W"/> 
		<bitfield id="LOCK" width="1" begin="4" end="4" resetval="0x0" description="Lock region. Once set the region values cannot be modified." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="ENABLE" width="4" begin="3" end="0" resetval="0x0" description="Enable region. A value of 0xA enables, others disable." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_2_start_address_l" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_2_start_address_l" offset="0x8450" width="32" description="The ISC Region 2 Start Address Low Register defines the start address bits 31 to 0 for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 2 ISC.">
		<bitfield id="START_ADDRESS_L" width="20" begin="31" end="12" resetval="0x0" description="Start address bits 31 to 12." range="31 - 12" rwaccess="R/W"/> 
		<bitfield id="START_ADDRESS_LSB" width="12" begin="11" end="0" resetval="0x0" description="Start address bits 11 to 0 must be 0 as address must be 4KB aligned in address mode. Can also be channel number in channel mode." range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_2_start_address_h" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_2_start_address_h" offset="0x8454" width="32" description="The ISC Region 2 Start Address High Register defines the start address bits 47 to 32 for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 2 ISC.">
		<bitfield id="START_ADDRESS_H" width="16" begin="15" end="0" resetval="0x0" description="Start address bits 47 to 32." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_2_end_address_l" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_2_end_address_l" offset="0x8458" width="32" description="The ISC Region 2 End Address Low Register defines the end included address bits 31 to 0 for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 2 ISC.">
		<bitfield id="END_ADDRESS_L" width="20" begin="31" end="12" resetval="0x0" description="End address bits 31 to 12 to include in the match." range="31 - 12" rwaccess="R/W"/> 
		<bitfield id="END_ADDRESS_LSB" width="12" begin="11" end="0" resetval="0x4095" description="End address bits 11 to 0 are forced to Fs as address must be 4KB aligned." range="11 - 0" rwaccess="R"/>
	</register>
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_2_end_address_h" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_2_end_address_h" offset="0x845C" width="32" description="The ISC Region 2 End Address High Register defines the end address bits 47 to 32 for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 2 ISC.">
		<bitfield id="END_ADDRESS_H" width="16" begin="15" end="0" resetval="0x0" description="End address bits 47 to 32." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_3_control" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_3_control" offset="0x8460" width="32" description="The ISC Region 3 Control Register defines the control fields for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 3 ISC.">
		<bitfield id="NOPRIV" width="2" begin="27" end="26" resetval="0x0" description="Clear output priv attribute. If each bit is set then the outgoing priv bit is cleared." range="27 - 26" rwaccess="R/W"/> 
		<bitfield id="PRIV" width="2" begin="25" end="24" resetval="0x0" description="Set outgoing priv attribute. If each bit is set then the outgoing priv bit is set." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PASS" width="1" begin="21" end="21" resetval="0x0" description="No privID replacement, pass through value." range="21" rwaccess="R/W"/> 
		<bitfield id="NONSEC" width="1" begin="20" end="20" resetval="0x0" description="Make outgoing non-secure." range="20" rwaccess="R/W"/> 
		<bitfield id="SEC" width="4" begin="19" end="16" resetval="0x0" description="Make outgoing secure. A value of 0xA enables, others disable." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PRIV_ID" width="8" begin="15" end="8" resetval="0x179" description="Priv ID." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="DEF" width="1" begin="6" end="6" resetval="0x0" description="Default region indication. The default region is used when all other regions do not match." range="6" rwaccess="R"/> 
		<bitfield id="CH_MODE" width="1" begin="5" end="5" resetval="0x0" description="Enable channel mode to match region to a chanid value. Otherwise use address mode to match region to an address range." range="5" rwaccess="R/W"/> 
		<bitfield id="LOCK" width="1" begin="4" end="4" resetval="0x0" description="Lock region. Once set the region values cannot be modified." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="ENABLE" width="4" begin="3" end="0" resetval="0x0" description="Enable region. A value of 0xA enables, others disable." range="3 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_3_start_address_l" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_3_start_address_l" offset="0x8470" width="32" description="The ISC Region 3 Start Address Low Register defines the start address bits 31 to 0 for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 3 ISC.">
		<bitfield id="START_ADDRESS_L" width="20" begin="31" end="12" resetval="0x0" description="Start address bits 31 to 12." range="31 - 12" rwaccess="R/W"/> 
		<bitfield id="START_ADDRESS_LSB" width="12" begin="11" end="0" resetval="0x0" description="Start address bits 11 to 0 must be 0 as address must be 4KB aligned in address mode. Can also be channel number in channel mode." range="11 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_3_start_address_h" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_3_start_address_h" offset="0x8474" width="32" description="The ISC Region 3 Start Address High Register defines the start address bits 47 to 32 for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 3 ISC.">
		<bitfield id="START_ADDRESS_H" width="16" begin="15" end="0" resetval="0x0" description="Start address bits 47 to 32." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_3_end_address_l" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_3_end_address_l" offset="0x8478" width="32" description="The ISC Region 3 End Address Low Register defines the end included address bits 31 to 0 for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 3 ISC.">
		<bitfield id="END_ADDRESS_L" width="20" begin="31" end="12" resetval="0x0" description="End address bits 31 to 12 to include in the match." range="31 - 12" rwaccess="R/W"/> 
		<bitfield id="END_ADDRESS_LSB" width="12" begin="11" end="0" resetval="0x4095" description="End address bits 11 to 0 are forced to Fs as address must be 4KB aligned." range="11 - 0" rwaccess="R"/>
	</register>
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_3_end_address_h" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_3_end_address_h" offset="0x847C" width="32" description="The ISC Region 3 End Address High Register defines the end address bits 47 to 32 for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 3 ISC.">
		<bitfield id="END_ADDRESS_H" width="16" begin="15" end="0" resetval="0x0" description="End address bits 47 to 32." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_4_control" acronym="ISC_REGS_Ipcie_g2x1_64_main_0_pcie_mst_wr_isc_region_4_control" offset="0x8480" width="32" description="The ISC Region 4 Control Register defines the control fields for the master Ipcie_g2x1_64_main_0.pcie_mst_wr region 4 ISC.">
		<bitfield id="NOPRIV" width="2" begin="27" end="26" resetval="0x0" description="Clear output priv attribute. If each bit is set then the outgoing priv bit is cleared." range="27 - 26" rwaccess="R/W"/> 
		<bitfield id="PRIV" width="2" begin="25" end="24" resetval="0x0" description="Set outgoing priv attribute. If each bit is set then the outgoing priv bit is set." range="25 - 24" rwaccess="R/W"/> 
		<bitfield id="PASS" width="1" begin="21" end="21" resetval="0x0" description="No privID replacement, pass through value." range="21" rwaccess="R/W"/> 
		<bitfield id="NONSEC" width="1" begin="20" end="20" resetval="0x0" description="Make outgoing non-secure." range="20" rwaccess="R/W"/> 
		<bitfield id="SEC" width="4" begin="19" end="16" resetval="0x0" description="Make outgoing secure. A value of 0xA enables, others disable." range="19 - 16" rwaccess="R/W"/> 
		<bitfield id="PRIV_ID" width="8" begin="15" end="8" resetval="0x179" description="Priv ID." range="15 - 8" rwaccess="R/W"/> 
		<bitfield id="DEF" width="1" begin="6" end="6" resetval="0x0" description="Default region indication. The default region is used when all other regions do not match." range="6" rwaccess="R"/> 
		<bitfield id="CH_MODE" width="1" begin="5" end="5" resetval="0x0" description="Enable channel mode to match region to a chanid value. Otherwise use address mode to match region to an address range." range="5" rwaccess="R/W"/> 
		<bitfield id="LOCK" width="1" begin="4" end="4" resetval="0x0" description="Lock region. Once set the region values cannot be modified." range="4" rwaccess="R/W1TS"/> 
		<bitfield id="ENABLE" width="4" begin="3" end="0" resetval="0x0" description="Enable region. A value of 0xA enables, others disable." range="3 - 0" rwaccess="R/W"/>
	</register>
